Repository: zareshahi/BlackHole
Catalog: lib/localization/app_*.arb
Languages: fa

source: Aboard
fa: سوار

source: About
fa: درباره

# aboutLine1
source: This is an open-source project and can be found on
fa: این یک پروژه منبع باز است و می توانید آن را پیدا کنیداین یک پروژه منبع باز است و می توانید آن را پیدا کنید

# aboutLine2
source: If you liked my work show some ♥ and ⭐ the repo
fa: اگر از این کار خوشتان آمد لطفا با ستاره از آن حمایت کنید

# accent
source: Accent Color & Hue
fa: عمق و طیف رنگ

source: Add New
fa: اضافه کردن

# addSomething
source: Go and Add Something
fa: چیزی اضافه کنید

source: Add to Playlist
fa: افزودن به لیست پخش

source: Add to Queue
fa: افزودن به صف

source: Added by
fa: اضافه شده توسط

source: Added to
fa: اضافه شده به

# addedToFav
source: Added to Favorites
fa: به لیست علاقه‌مندی‌ها افزوده شد

source: Added to Playlists
fa: به لیست پخش افزوده شد

source: Added to Queue
fa: به صف افزوده شد

source: Adjust Speed
fa: تنظیم سرعت

source: Album
fa: آلبوم

source: Album Artist
fa: خواننده آلبوم

source: Albums
fa: آلبوم‌ها

source: Alphabetical
fa: الفبایی

source: Already Exists
fa: از قبل وجود دارد

source: Already in Queue
fa: در صف وجود دارد

# appTitle
source: BlackHole
fa: چاله سیاه

source: Artist
fa: خواننده

source: Artists
fa: خوانندگان

# autoBack
source: Auto Backup
fa: پشتیبان گیری خودکار

# autoBackLocation
source: Auto Backup Location
fa: مسیر پشتیبان گیری خودکار

# autoBackSub
source: Automatically backup data
fa: پشتیبان گیری خودکار از داده‌ها

source: Autoplay
fa: پخش خودکار

# autoplaySub
source: Automatically add related songs to the queue
fa: آهنگ های مرتبط را به صورت خودکار به صف اضافه کنید

source: Back
fa: بازگشت

# backNRest
source: Backup & Restore
fa: پشتیبان گیری و بازیابی

# backupSuccess
source: Backup Successful
fa: پشتیبان گیری موفق

# bgGrad
source: Background Gradient
fa: طیف رنگی پس‌زمینه

# bgGradSub
source: Gradient used as background everywhere
fa: طیف رنگی به عنوان پس‌زمینه در همه جا استفاده می‌شود

source: Blacklisted Home Sections
fa: بخش‌های خانه در لیست سیاه

# blacklistedHomeSectionsSub
source: Sections with these titles won't be shown on Home Screen
fa: بخش‌هایی با این عناوین در صفحه اصلی نشان داده نمی‌شوند

# bottomGrad
source: Bottom Sheets Gradient
fa: طیف رنگی صفحه پایین

# bottomGradSub
source: Gradient used in Bottom Sheets
fa: طیف رنگی استفاده شده در صفحه پایین

# buyCoffee
source: Buy me a coffee
fa: برای من یک قهوه بخر

source: Cache
fa: حافظه پنهان

# cacheSong
source: Cache Songs
fa: آهنگ‌های ذخیره شده در حافظه پنهان

# cacheSongSub
source: Songs will be cached for future playback. Additional space on your device will be taken
fa: آهنگ‌ها برای پخش بعدی ذخیره می‌شوند. فضای اضافی در دستگاه شما گرفته خواهد شد

source: Cancel
fa: لغو

# cantAddToQueue
source: Can't add Online Song to Offline Queue
fa: نمی‌توان آهنگ آنلاین را به صف آفلاین اضافه کرد

source: Canvas Color
fa: رنگ صفحه

# canvasColorSub
source: Color of Background Canvas
fa: رنگ پس زمینه صفحه

source: Card Color
fa: رنگ کارت

# cardColorSub
source: Color of Search Bar, Alert Dialogs, Cards
fa: رنگ نوار جستجو، دیالوگ‌های هشدار، کارت‌ها

# cardGrad
source: Card Gradient
fa: طیف رنگ کارت

# cardGradSub
source: Gradient used in Cards
fa: طیف رنگ استفاده شده در کارت‌ها

# changeDefault
source: Change to Default
fa: بازگشت به پیشفرض

# changeOrder
source: Long Press to change order
fa: برای تغییر ترتیب، طولانی فشار دهید

# chartLocation
source: Spotify Local Charts Location
fa: مکان نمودارهای محلی Spotify

# chartLocationSub
source: Country for Top Spotify Local Charts
fa: کشور برای نمودارهای محلی برتر Spotify

# checkUpdate
source: Auto check for Updates
fa: بررسی خودکار برای به‌روز‌رسانی

# checkUpdateSub
source: If you downloaded BlackHole from any app repository like 'F-Droid', 'IzzyOnDroid', etc which provide update options, keep this OFF. Whereas, If you downloaded it from 'GitHub' or any other source which doesn't provide auto updates then turn this ON, so as to receive update alerts
fa: اگر BlackHole را از هر مخزن برنامه ای مانند 'F-Droid'، 'IzzyOnDroid' و غیره دانلود کرده اید که گزینه های به روز رسانی را ارائه می دهد، آن را خاموش نگه دارید. در حالی که، اگر آن را از «GitHub» یا هر منبع دیگری که به‌روزرسانی خودکار ارائه نمی‌کند دانلود کرده‌اید، آن را روشن کنید تا هشدارهای به‌روزرسانی دریافت کنید.

# checkingUpdate
source: Checking for Updates…
fa: در حال بررسی به‌روزرسانی‌ها…

source: Clear
fa: پاک کردن

source: Clear All
fa: پاک کردن همه

# clearCache
source: Clear Cached Details
fa: پاک کردن اطلاعات ذخیره شده در حافظه پنهان

# clearCacheSub
source: Deletes Cached details including Homepage, Spotify Top Charts, YouTube and Last Session Data. Usually app automatically clears them when data become large
fa: جزئیات ذخیره شده از جمله صفحه اصلی، نمودارهای برتر Spotify، YouTube و داده‌های آخرین جلسه را حذف می‌کند. معمولاً برنامه زمانی که داده‌ها بزرگ می‌شوند آنها را به طور خودکار پاک می‌کند

# confirmViewable
source: Make sure the playlist is viewable
fa: مطمئن شوید که لیست پخش قابل مشاهده است

# connectingRadio
source: Connecting to Radio…
fa: در حال اتصال به رادیو…

source: Contact Us
fa: تماس با ما

# contactUsSub
source: Feedbacks Appreciated!
fa: از بازخورد شما متشکریم

source: Converting Songs
fa: تبدیل آهنگ‌ها

# copied
source: Copied to Clipboard!
fa: در کلیپ بورد کپی شد!

source: Copy
fa: کپی

# countryQue
source: For which country would you like to see Spotify Local Charts?
fa: برای کدام کشور دوست دارید نمودارهای محلی Spotify را ببینید؟

# createAlbumFold
source: Create folder for Album & Playlist Download
fa: پوشه ای برای دانلود آلبوم و لیست پخش ایجاد کنید

# createAlbumFoldSub
source: Creates common folder for Songs when Album or Playlist is downloaded
fa: هنگام دانلود آلبوم یا لیست پخش، پوشه مشترکی برای آهنگ‌ها ایجاد می کند

# createBack
source: Create Backup
fa: پشتیبان گیری

# createBackSub
source: Create backup of your data
fa: گرفتن نسخه پشتیبان از داده‌ها

source: Create New Playlist
fa: ایجاد لیست پخش جدید

source: Create Playlist
fa: ایجاد لیست پخش

# createYtFold
source: Create different folder for YouTube Downloads
fa: پوشه متفاوتی برای دانلودهای YouTube ایجاد کنید

# createYtFoldSub
source: Creates a different folder for Songs downloaded from YouTube
fa: یک پوشه متفاوت برای آهنگ های دانلود شده از YouTube ایجاد می کند

source: Current Theme
fa: پوسته فعلی

source: Dark Mode
fa: تم تیره

source: Date
fa: تاریخ

source: Date Added
fa: تاریخ افزوده شدن

# dec
source: Decreasing
fa: نزولی

source: Delete
fa: پاک کردن

source: Delete Theme
fa: پاک کردن پوسته

# deleteThemeSubtitle
source: Are you sure you want to delete?
fa: آیا مطمئنید که میخواهید حذف کنید؟

source: Deleted
fa: حذف شده

source: Disclaimer :
fa: سلب مسئولیت :

# disclaimerText
source: We respect your privacy more than anything else. Only your name, which you will enter here, will be recorded.
fa: ما به حریم خصوصی شما بیش از هر چیز دیگری احترام می گذاریم. فقط نام شما که در اینجا وارد می کنید ثبت می شود.

source: Display Name
fa: نام

# donateGpay
source: Donate with GPay
fa: با GPay کمک مالی کنید

# donateGpaySub
source: Every small amount makes me smile :) Tap to donate or Long press to copy UPI ID
fa: هر مقدار کمی باعث لبخند من می شود :) برای اهدا ضربه بزنید یا برای کپی کردن شناسه UPI فشار طولانی دهید

# down
source: Download
fa: دانلود

# downAgain
source: already exists. Do you want to download it again?
fa: همکنون موجود است. آیا می خواهید دوباره آن را دانلود کنید؟

# downDone
source: Download Done
fa: پایان دانلود

# downFilename
source: Download Name Format
fa: نام فرمت دانلود

# downFilenameSub
source: Songs will be downloaded according to this filename format
fa: آهنگ‌ها بر اساس این فرمت نام فایل دانلود خواهند شد

# downLocation
source: Download Location
fa: مکان دانلود

# downLyrics
source: Download Lyrics
fa: دانلود متن شعر

# downLyricsSub
source: Downloading lyrics along with song, if available
fa: دانلود متن آهنگ همراه با آهنگ در صورت موجود بودن

# downQuality
source: Download Quality
fa: کیفیت دانلود

# downQualitySub
source: Higher quality uses more disk space
fa: کیفیت بالاتر از فضای دیسک بیشتری استفاده می کند

# downed
source: has been downloaded
fa: دانلود شد

# downingAlbum
source: Downloading Album
fa: دانلود آلبوم

source: Download Something
fa: دانلود چیزی

# downs
source: Downloads
fa: دانلودها

source: Duration
fa: زمانبندی

source: Edit
fa: ویرایش

# enableGesture
source: Enable Artwork Gestures
fa: فعال کردن ژست‌های آثار هنری

# enableGestureSub
source: Enables tap, longress, swipe, etc on the Artwork in Player Screen
fa: ضربه زدن، طولانی شدن، کشیدن انگشت و غیره را روی آثار هنری در صفحه پخش فعال می کند

# enforceRepeat
source: Enforce Repeating
fa: اجرای تکرار

# enforceRepeatSub
source: Keep the same repeat option for every session
fa: همان گزینه تکرار را برای هر جلسه نگه دارید

# enterName
source: Enter Your Name
fa: نام خود را وارد کنید

source: Enter Playlist Link
fa: لینک لیست پخش را وارد کنید

# enterSongsCount
source: Enter no of Songs
fa: تعداد آهنگ‌ها را وارد کنید

source: Enter Text
fa: متن را وارد کنید

source: Enter theme name
fa: نام پوسته را وارد کنید

source: Equalizer
fa: اکولایزر

source: Excluded
fa: استثنا

# excludedDetails
source: Songs from selected folders will not be shown
fa: آهنگ های پوشه های انتخابی نشان داده نمی شوند

# exitConfirm
source: Press Back Again to Exit App
fa: برای خروج از برنامه، دوباره بازگشت را فشار دهید

source: Export
fa: خروجی

source: Exported
fa: خروجی گرفته شد

# failedCreateBackup
source: Failed to create Backup
fa: خطا در پشتیبان گیری

# failedDelete
source: Failed to Delete
fa: خطا در حذف

# failedExport
source: Failed to Export
fa: خطا در گرفتن خروجی

# failedImport
source: Failed to Import
fa: خطا در وارد کردن

# failedTagEdit
source: Failed to edit tags
fa: خطا در ویرایش تگ‌ها

# favSongs
source: Favorite Songs
fa: آهنگ‌های مورد علاقه

source: Favorites
fa: علاقه‌مندی‌ها

# fetchingStream
source: Fetching Audio Stream
fa: در حال دریافت جریان آهنگ

source: Finish
fa: پایان

source: from
fa: از

source: Genre
fa: ژانر

source: Genres
fa: ژانرها

# getLyricsOnline
source: Search lyrics of local songs
fa: جستجوی متن آهنگ های محلی

# getLyricsOnlineSub
source: Search online if lyrics aren't available/downloaded for any offline song
fa: اگر شعر برای هر آهنگ آفلاینی در دسترس نیست یا دانلود نشده است، به صورت آنلاین جستجو کنید

source: Get Started
fa: شروع

source: Global
fa: عمومی

source: Guest
fa: مهمان

source: Home
fa: خانه

# homeGreet
source: Hi There,
fa: خوش آمدی,

# importFile
source: Import from File
fa: وارد کردن از فایل

# importJioSaavn
source: Import from JioSaavn
fa: وارد کردن از JioSaavn

source: Import Playlist
fa: وارد کردن لیست پخش

source: Import Public Playlist
fa: وارد کردن لیست پخش عمومی

# importResso
source: Import from Resso
fa: وارد کردن از Resso

# importSpotify
source: Import from Spotify
fa: وارد کردن از Spotify

# importSuccess
source: Successfully imported
fa: با موفقیت وارد شد

# importYt
source: Import from YouTube
fa: وارد کردن از YouTube

# inc
source: Increasing
fa: افزایشی

# includeExcludeFolder
source: Include/Exclude Folders
fa: شمول/استثنا پوشه

# includeExcludeFolderSub
source: Includes/Excludes selected folders from 'My Music' Section
fa: شامل/استثنا پوشه‌های انتخاب شده از بخش 'موسیقی من'.

source: Included
fa: شامل شده

# includedDetails
source: Only songs from selected folders will be shown
fa: فقط آهنگ‌ها از پوشه های انتخاب شده نشان داده می‌شوند

# insta
source: Instagram
fa: اینستاگرام

# joinTg
source: Join us on Telegram
fa: در تلگرام به ما بپیوندید

# joinTgSub
source: Want to Test beta versions? Join us now!
fa: می‌خواهید نسخه بتا را تست کنید؟ به ما بپیوندید

# langQue
source: Which language songs would you prefer to listen to?
fa: ترجیح می دهید به کدام زبان آهنگ گوش دهید؟

# langSub
source: App Text Language
fa: زبان متن برنامه

source: Last Added
fa: آخرین اضافه شده

source: Last Modified
fa: آخرین تغییر

source: Last Session
fa: آخرین جلسه

# latest
source: Congrats! You are using the latest version :)
fa: تبریک میگم شما از آخرین نسخه استفاده می کنید :)

source: Library
fa: کتابخانه

source: Like
fa: پسندیدن

# likedWork
source: Liked my work?
fa: کار من را دوست داشتید؟

# live
source: LIVE NOW
fa: زنده

source: Live Search
fa: جستجوی زنده

# liveSearchSub
source: Search songs as soon as user stops typing
fa: به محض اینکه کاربر تایپ را متوقف کرد، آهنگ‌ها را جستجو کنید

# loadLast
source: Load Last Session on App Start
fa: آخرین جلسه را در شروع برنامه بارگیری کنید

# loadLastSub
source: Automatically load last session when app starts
fa: با شروع برنامه، آخرین جلسه به طور خودکار بارگیری می شود

source: Local
fa: محلی

source: Lyrics
fa: اشعار

# madeBy
source: Made with ♥ by Ankit Sangwan
fa: ساخته شده با ♥ توسط Ankit Sangwan

source: Merge Playlists
fa: ادغام لیست‌های پخش

# minAudioAlert
source: Min Audio Length (in sec)
fa: حداقل طول صدا (به ثانیه)

# minAudioLen
source: Min Audio Length to search music
fa: حداقل طول صدا برای جستجوی موسیقی

# minAudioLenSub
source: Audios with length smaller than this will not be shown in 'My Music' Section
fa: صداهای با طول کمتر از این در بخش موسیقی من نشان داده نمی‌شوند

# miniButtons
source: Buttons to show in Mini Player
fa: دکمه‌هایی برای نمایش در Mini Player

# miniButtonsSub
source: Tap to change buttons shown in the Mini Player
fa: برای تغییر دکمه های نشان داده شده در Mini Player ضربه بزنید

source: minutes
fa: دقیقه

source: More Info
fa: اطلاعات بیشتر

# musicLang
source: Music Language
fa: زبان موسیقی

# musicLangSub
source: To display songs on Home Screen
fa: برای نمایش آهنگ‌ها در صفحه اصلی

source: Music & Playback
fa: موسیقی و بازپخش

source: My Music
fa: موسیقی من

source: No
fa: نه

source: No Folder selected
fa: هیچ پوشه‌ای انتخاب نشده است

# noLangSelected
source: No Music language selected. Select a language to see songs on Home Screen
fa: هیچ زبان موسیقی انتخاب نشده است. زبانی را برای دیدن آهنگ ها در صفحه اصلی انتخاب کنید

source: Not Available
fa: در دسترس نیست

source: Nothing is
fa: هیچ چیزی

# nothingPlaying
source: Nothing is Playing
fa: هیچ چیزی پخش نمی‌شود

source: Nothing to
fa: هیچ چیزی به

source: Now Playing
fa: در حال پخش

source: Ok
fa: باشه

source: Open In Spotify
fa: باز کردن در Spotify

source: OR
fa: یا

source: Others
fa: موارد بیشتر

source: Pause
fa: توقف

source: Play
fa: پخش

source: Play Next
fa: پخش کردن بعدی

source: Play Radio
fa: پخش کردن رادیو

# playSomething
source: Go and Play Something
fa: یه چیزی پخش کن

source: Player Screen Background
fa: پس زمینه صفحه پخش کننده

# playerScreenBackgroundSub
source: Selected Background will be shown in Player Screen
fa: پس زمینه انتخاب شده در صفحه پخش نمایش داده می شود

source: Playing
fa: پخش کردن

# playingCap
source: PLAYING
fa: پخش کردن

# playlistShareText
source: Have a look at my playlist!
fa: به لیست پخش من نگاهی بیندازید!

source: Playlists
fa: لیست پخش

source: Popularity
fa: محبوبیت

# prefReq
source: Mind telling us a few things?
fa: قصد دارید چند نکته را به ما بگویید؟

# proxySet
source: Proxy Settings
fa: تنظیمات پروکسی

# proxySetSub
source: Change Proxy IP and Port
fa: تغیر آیپی و پورت پروکسی

# rememberChoice
source: Remember my choice
fa: انتخاب مرا به خاطر بسپار

source: Remove
fa: پاک کردن

source: Removed
fa: پاک شد

source: Removed from
fa: پاک کردن از

# removedFromFav
source: Removed from Favorites
fa: پاک کردن از علاقه‌مندی‌ها

source: Rename
fa: تغییر نام

source: Reset
fa: بازنشانی

# resetOnSkipSub
source: Replay from start instead of skipping to previous song
fa: به جای پرش به آهنگ قبلی، از ابتدا پخش کنید

source: Restore
fa: بازیابی

# restoreSub
source: Restore your data from Backup. You might need to restart app
fa: داده های خود را از پشتیبان گیری بازیابی کنید. ممکن است نیاز به راه اندازی مجدد برنامه داشته باشید

source: Results Not Found
fa: نتیجه‌ای یافت نشد

source: Save Playlist
fa: ذخیره لیست پخش

source: Save Theme
fa: ذخیره پوسته

source: Search
fa: جستجو

source: Search Home
fa: خانه جستجو

# searchText
source: Songs, albums or artists
fa: آهنگ‌ها، آلبوم‌ها یا هنرمندان

source: Search Video
fa: جستجوی ویدیو

# searchYt
source: Search on YouTube
fa: جستجو در YouTube

# selectBackFile
source: Select Backup File
fa: انتخاب فایل پشتیبان

# selectBackLocation
source: Select Backup Location
fa: انتخاب محل پشتیبان گیری

# selectDownLocation
source: Select Download Location
fa: انتخاب محل دانلود

# selectDur
source: Select a Duration
fa: انتخاب بازه زمانی

source: Select Export Location
fa: انتخاب محل خروجی

# selectJsonImport
source: Select JSON file to import
fa: انتخاب فایل JSON برای ورود

source: Settings
fa: تنظیمات

source: Share
fa: اشتراک گذاری

source: Share App
fa: اشتراک گذاری برنامه

# shareAppSub
source: Let you friends know about us
fa: به دوستات بگو ما کی هستیم

# shareAppText
source: Hey! Check out this cool music player app
fa: سلام! این برنامه پخش کننده موسیقی جالب را بررسی کنید

source: Show Here
fa: نمایش

# showHistory
source: Show Search History
fa: نمایش تاریخچه جستجو

# showHistorySub
source: Show Search History below Search Bar
fa: نمایش سابقه جستجو در زیر نوار جستجو

# showLast
source: Show Last Session
fa: نمایش آخرین نشست

# showLastSub
source: Show Last session on Home Screen
fa: نمایش آخرین نشست در صفحه اصلی

# showPlaylists
source: Show Playlists on Home Screen
fa: نمایش لیست های پخش در صفحه اصلی

# showQr
source: Show QR Code
fa: نمایش QR Code

source: Shuffle
fa: تصادفی

# signInSpotify
source: Sign in to Spotify
fa: وارد Spotify شوید

source: Size
fa: اندازه

source: Skip
fa: عبور کردن

source: Skip Next
fa: بعدی

source: Skip Previous
fa: قبلی

# sleepAfter
source: Sleep after N Songs
fa: بعد از N آهنگ متوقف شو

# sleepAfterSub
source: Music will stop after playing selected no of songs
fa: پس از پخش هیچ آهنگ انتخابی، موسیقی متوقف می شود

# sleepDur
source: Sleep after a duration of hh:mm
fa: خاموش شدن بعد از hh:mm

# sleepDurSub
source: Music will stop after selected duration
fa: موسیقی بعد از زمان انتخاب شده خاموش خواهد شد

source: Sleep Timer
fa: زمانبندی خاموش شدن

source: Sleep Timer set for
fa: زمانبند خاموشی تنظیم شده برای

source: Song
fa: موسیقی

source: Song Info
fa: اطلاعات موسیقی

source: Song Path
fa: مسیر موسیقی

source: Songs
fa: موسیقی‌ها

source: SORRY
fa: شرمنده

# sponsor
source: Sponsor this project
fa: حامی این پروژه

source: Spotify Charts
fa: نمودارهای Spotify

source: Spotify Public
fa: Spotify عمومی

source: Spotify Top Charts
fa: بهترین‌های Spotify

# stopDown
source: Stop Download
fa: توقف دانلود

# stopOnClose
source: Stop music on App Close
fa: توقف موسیقی بعد از بسته شدن برنامه

# stopOnCloseSub
source: If turned off, music won't stop even after app is 'closed', until you press stop button. This option is for app 'close' not when app is in 'background'. Music will always play in background you don't need to change any setting for that.
fa: اگر خاموش باشد، موسیقی حتی پس از «بسته شدن» برنامه متوقف نخواهد شد، مگر اینکه دکمه توقف را فشار دهید. این گزینه برای برنامه "بستن" است نه زمانی که برنامه در "پس‌زمینه" است. موسیقی همیشه در پس‌زمینه پخش می‌شود و نیازی به تغییر هیچ تنظیماتی برای آن ندارید.
